Repository: justlostintime/ScriptBuilder
Catalog: .lang/*.po
Languages: de, es_es, fr, hi, it, ja

source: 'Example By Charlie Ogier
de: 'Beispiel von Charlie Ogier
es_es: 'Ejemplo de Charlie Ogier
fr: 'Exemple par Charlie Ogier
hi: 'चार्ली ओगियर द्वारा उदाहरण'
it: 'Esempio scritto da Charlie Ogier
ja: 'チャーリーオジエによる例

source: 'Nibble Example
de: 'Knabber-Beispiel
es_es: 'Ejemplo de mordisco
fr: 'Exemple de Nibble
hi: 'निबल उदाहरण'
it: 'Esempio di Nibble
ja: 'ニブルの例

source: About
de: Über
es_es: Sobre
fr: À propos
hi: के बारे में
it: Riguardo a
ja: だいたい

source: All Files
de: Alle Dateien
es_es: Todos los archivos
fr: Tous les fichiers
hi: सभी फाइलें
it: Tutti i files
ja: すべてのファイル

source: Any Issues Or enhancement requests please send email To
de: Bei Problemen oder Verbesserungswünschen senden Sie bitte eine E-Mail an
es_es: Cualquier problema o solicitud de mejora, envíe un correo electrónico a
fr: Pour tout problème ou demande d'amélioration, veuillez envoyer un e-mail à
hi: कोई भी समस्या या एन्हांसमेंट अनुरोध कृपया ईमेल भेजें
it: Eventuali problemi o richieste di miglioramento inviare un'e-mail
ja: 問題や機能強化のリクエストがある場合は、メールでお問い合わせください

source: Builder ->
de: Baumeister ->
es_es: Constructor ->
fr: Constructeur ->
hi: बिल्डर ->
it: Costruttore ->
ja: ビルダー->

source: Cancel
de: Stornieren
es_es: Cancelar
fr: Annuler
hi: रद्द करना
it: Annulla
ja: キャンセル

source: Choose a Script file
de: Wählen Sie eine Skriptdatei
es_es: Elija un archivo de secuencia de comandos
fr: Choisissez un fichier de script
hi: एक स्क्रिप्ट फ़ाइल चुनें
it: Scegli un file di script
ja: スクリプトファイルを選択します

source: Clear All
de: Alles löschen
es_es: Limpiar todo
fr: Tout effacer
hi: सभी साफ करें
it: Cancellare tutto
ja: すべてクリア

source: Clear WorkSpace
de: WorkSpace löschen
es_es: Borrar espacio de trabajo
fr: Effacer l'espace de travail
hi: कार्यक्षेत्र साफ़ करें
it: Cancella spazio di lavoro
ja: ワークスペースをクリアする

source: Close
de: Schließen
es_es: Cerca
fr: Fermer
hi: बंद करना
it: Chiudere
ja: 選ぶ

source: Command Line args->
de: Befehlszeile args->
es_es: Argumentos de línea de comando->
fr: Args de ligne de commande->
hi: कमांड लाइन आर्ग्स->
ja: コマンドライン引数->

source: Console Script
de: Konsolenskript
es_es: Guión de consola
fr: Script de console
hi: कंसोल स्क्रिप्ट
it: Script della console

source: Copy
de: Kopieren
es_es: Copiar
fr: Copie
hi: प्रतिलिपि
it: Copia
ja: コピー

source: Copy Content
de: Inhalt kopieren
es_es: Copiar contenido
fr: Copier le contenu
hi: कॉपी सामग्री
it: Copia contenuto
ja: コンテンツをコピーする

source: Copy To Editor
de: In Editor kopieren
es_es: Copiar al editor
fr: Copier dans l'éditeur
hi: संपादक को कॉपी करें
it: Copia nell'editor
ja: エディターにコピー

source: Create a new non graphic script
de: Erstellen Sie ein neues nicht grafisches Skript
es_es: Crear un nuevo guión no gráfico
fr: Créer un nouveau script non graphique
hi: एक नई गैर ग्राफिक स्क्रिप्ट बनाएं
it: Crea un nuovo script non grafico

source: Cut
de: Schnitt
es_es: Corte
fr: Couper
hi: कट गया
it: Tagliare
ja: 切る

source: Debug
de: Debuggen
es_es: Depurar
fr: Déboguer
hi: डिबग
ja: デバッグ

source: DEBUG(Off)
de: DEBUG (Aus)
es_es: DEPURAR(Apagado)
fr: DEBUG (désactivé)
hi: डीबग (बंद)
it: DEBUG (Disattivato)
ja: デバッグ（オフ）

source: DEBUG(On)
de: DEBUG (Ein)
es_es: DEPURAR(Activado)
fr: DEBUG (activé)
hi: डीबग (चालू)
it: DEBUG(Attivo)
ja: デバッグ（オン)

source: Edit
de: Bearbeiten
es_es: Editar
fr: Éditer
hi: संपादन करना
it: Modificare
ja: 編集

source: Error Fetching Code
de: Fehler beim Abrufen des Codes
es_es: Error al obtener el código
fr: Erreur de récupération du code
hi: कोड लाने में त्रुटि
it: Errore durante il recupero del codice
ja: コードのフェッチ中にエラーが発生しました

source: Error fetching list of examples
de: Fehler beim Abrufen der Probenliste
es_es: Error al obtener la lista de ejemplos
fr: Erreur lors de la récupération de la liste des exemples
hi: उदाहरणों की सूची लाने में त्रुटि
it: Errore durante la ricezione dell'elenco di esempi
ja: サンプルリストの取得中にエラーが発生しました

source: Error Fetching Nibble code example
de: Fehler beim Abrufen des Nibble-Code-Beispiels
es_es: Error al obtener el ejemplo de código de Nibble
fr: Erreur lors de la récupération de l'exemple de code Nibble
hi: निबल कोड उदाहरण लाने में त्रुटि
it: Errore durante la ricezione dell'esempio di codice del Nibble
ja: Nibbleコード例のフェッチ中にエラーが発生しました

source: Examples From PlayGround - By Charlie Ogier
de: Beispiele aus PlayGround - Von Charlie Ogier
es_es: Ejemplos de PlayGround - Por Charlie Ogier
fr: Exemples de PlayGround - Par Charlie Ogier
hi: खेल के मैदान से उदाहरण - चार्ली ओगियर द्वारा khel ke maidaan se udaaharan - chaarlee ogiyar dvaara
it: Esempi da PlayGround - di Charlie Ogier
ja: PlayGroundの例-CharlieOgier著

source: Execute
de: Ausführen
es_es: Ejecutar
fr: Exécuter
hi: निष्पादित
it: Eseguire
ja: 実行する

source: Execute the script
de: Führen Sie das Skript aus
es_es: Ejecutar el script
fr: Exécuter le script
hi: स्क्रिप्ट निष्पादित करें
it: Esegui lo script

source: Exit
de: Ausgang
es_es: Salida
fr: Sortie
hi: बाहर निकलना
it: Uscita
ja: 出口

source: File
de: Datei
es_es: Expediente
fr: Fichier
hi: फ़ाइल
ja: ファイル

source: Gambas 3 Reference Guide
de: Gambas 3 Referenzhandbuch
es_es: Guía de referencia de Gambas 3
fr: Guide de référence Gambas 3
hi: गाम्बस 3 संदर्भ गाइड
it: Guida di riferimento di Gambas3
ja: Gambas3リファレンスガイド

source: Gambas 3 Scripting Reference
de: Gambas 3 Scripting Referenz
es_es: Referencia de secuencias de comandos de Gambas 3
fr: Référence de script Gambas 3
hi: गाम्बस 3 स्क्रिप्टिंग संदर्भ
it: Riferimento script Gambas3
ja: Gambas3スクリプトリファレンス

source: Gambas One Playground
es_es: Parque infantil Gambas One
fr: Terrain de jeux Gambas One
hi: गाम्बस वन खेल का मैदान

source: Gambas One Playground examples
es_es: Ejemplos de Gambas One Playground
fr: Exemples de Gambas One Playground
hi: गाम्बस वन प्लेग्राउंड उदाहरण

source: Gambas Script Online Resource
de: Online-Ressource für Gambas-Skripte
es_es: Recurso en línea de Gambas Script
fr: Ressources en ligne Gambas Script
hi: गाम्बस स्क्रिप्ट ऑनलाइन संसाधन
it: Risorsa in linea di Gambas Script

source: Gambas Script Resources
de: Gambas-Skriptressourcen
es_es: Recursos de guiones de Gambas
fr: Ressources sur les scripts Gambas
hi: गाम्बस स्क्रिप्ट संसाधन
it: Risorse per gli script di Gambas

source: Go
de: Gehen
es_es: Vamos
fr: Aller
hi: जाओ
it: Inizio
ja: 行く

source: Go->
es_es: Vamos->
fr: Aller->
hi: जाओ->
it: Inizio->
ja: 行く->

source: Graphic Script
de: Grafikskript
es_es: Escritura gráfica
fr: Script graphique
hi: ग्राफिक स्क्रिप्ट
it: Script Grafico
ja: グラフィックスクリプト

source: Help
de: Hilfe
es_es: Ayuda
fr: Aidez-moi
hi: मदद करना
it: Aiuto
ja: ヘルプ

source: Insert Into Editor
de: In Editor einfügen
es_es: Insertar en el editor
fr: Insérer dans l'éditeur
hi: संपादक में डालें
it: Inserisci nell'editor
ja: エディターに挿入

source: Insert Selected To Editor
de: Ausgewählte in Editor einfügen
es_es: Insertar seleccionado en el editor
fr: Insérer la sélection dans l'éditeur
hi: संपादक के लिए चयनित सम्मिलित करें
it: Inserisci selezionato nell'editor
ja: 選択内容をエディターに挿入します

source: Insert To Editor
de: In Editor einfügen
es_es: Insertar al editor
fr: Insérer dans l'éditeur
hi: संपादक में डालें
it: Inserisci nell'editor
ja: エディターに挿入

source: It Is Very simple And light And Is Also useful For learing simple programming skills outside Of an IDE.
de: Es ist sehr einfach und leicht, und es ist auch nützlich, um grundlegende Programmierkenntnisse außerhalb einer IDE zu erlernen.
es_es: Es muy simple y ligero y también es útil para aprender habilidades de programación simples fuera de un IDE.
fr: Il est très simple et léger et est également utile pour apprendre des compétences de programmation simples en dehors d'un IDE
hi: यह बहुत ही सरल और हल्का है और एक IDE के बाहर सरल प्रोग्रामिंग कौशल सीखने के लिए भी उपयोगी है।
it: È molto semplice e leggero ed è anche utile per apprendere semplici abilità di programmazione al di fuori di un IDE.
ja: 非常にシンプルで軽量であり、IDEの外部で簡単なプログラミングスキルを学ぶのにも役立ちます。

source: ldir - ls program with changes
de: ldir - ls Programm mit Änderungen
es_es: ldir - programa ls con cambios
fr: ldir - programme ls avec modifications
hi: ldir - ls प्रोग्राम परिवर्तन के साथ
it: ldir - programma ls con modifiche
ja: ldir-変更されたlsプログラム

source: Lib
es_es: biblioteca
hi: पुस्तकालय
it: Biblioteca

source: Local Resource Lib
de: Lokale Ressourcenbibliothek
es_es: Biblioteca de recursos locales
fr: Bibliothèque de ressources locales
hi: स्थानीय संसाधन पुस्तकालय
it: Biblioteca di risorse locali

source: Local script library
de: Lokale Skriptbibliothek
es_es: Biblioteca de scripts locales
fr: Bibliothèque de scripts locaux
hi: स्थानीय लिपि पुस्तकालय
it: Libreria di script locali

source: Max Symbols
de: Maximale Symbole
es_es: Símbolos máximos
fr: Nombre maximum de symboles
hi: अधिकतम प्रतीक
it: Simboli massimi
ja: 最大シンボル

source: mdir - ls different format
de: mdir - ls anderes Format
es_es: mdir - ls formato diferente
fr: mdir - format différent
hi: mdir - ls अलग प्रारूप
it: mdir - ls formato diverso
ja: mdir--ls異なる形式

source: New
de: Neu
es_es: Nuevo
fr: Nouveau
hi: नया
it: Nuovo
ja: 新しい

source: New From Example
de: Neu aus Beispiel
es_es: Nuevo de ejemplo
fr: Nouveau à partir de l'exemple
hi: उदाहरण से नया
it: Nuovo dall'esempio
ja: 例からの新規

source: New From Sample
de: Neu aus Probe
es_es: Nuevo de muestra
fr: Nouveau à partir de l'échantillon
hi: नमूना से नया
it: Nuovo da campione
ja: サンプルからの新規

source: Nibble bit
de: Knabberbit
es_es: mordisco - poco
hi: निबल बिट
ja: ニブルビット

source: Nibble library browser
de: Browser der Nibble-Bibliothek
es_es: Navegador de la biblioteca Nibble
fr: Parcourir la bibliothèque Nibble
hi: निबल लाइब्रेरी ब्राउज़र
it: Browser della libreria Nibble
ja: ニブルライブラリブラウザ

source: Nibble Library Directory
de: Nibble Bibliotheksverzeichnis
es_es: Directorio de la biblioteca de Nibble
fr: Répertoire de la bibliothèque Nibble
hi: निबल लाइब्रेरी निर्देशिका
it: Directory della libreria Nibble
ja: ニブル図書館ディレクトリ

source: No Program to run!
de: Kein Programm zum Ausführen!
es_es: ¡Ningún programa para ejecutar!
fr: Aucun programme à exécuter !
hi: चलाने के लिए कोई कार्यक्रम नहीं!
it: Nessun programma da eseguire!
ja: 実行するプログラムはありません！

source: No repository provided
de: Kein Repository bereitgestellt
es_es: No se proporciona repositorio
fr: Aucun référentiel fourn
hi: कोई भंडार प्रदान नहीं किया गया
it: Nessun repository fornito
ja: リポジトリが提供されていません

source: Not Found
de: Nicht gefunden
es_es: No encontrado
fr: Pas trouvé
hi: पता नहीं चला
it: Non trovato
ja: 見つかりません

source: Nothing Selected
de: Nichts ausgewählt
es_es: Nada seleccionado
fr: Rien de sélectionné
hi: कुछ भी चयनित नहीं
it: Niente selezionato
ja: 何も選択されていません

source: No Working Directory Specified for project
de: Kein Arbeitsverzeichnis für das Projekt angegeben
es_es: No se especificó un directorio de trabajo para el proyecto
fr: Aucun répertoire de travail spécifié pour le projet
hi: परियोजना के लिए कोई कार्य निर्देशिका निर्दिष्ट नहीं है
it: Nessuna directory di lavoro specificata per il progetto
ja: プロジェクトの作業ディレクトリが提供されていません

source: Off
de: Aus
es_es: Apagado
fr: De
hi: बंद
it: Spento
ja: オフ

source: On
de: Auf
es_es: En
fr: Sur
hi: पर
it: Sopra
ja: オン

source: Online Gambas Script Library
de: Online-Gambas-Skriptbibliothek
es_es: Biblioteca de scripts de Gambas en línea
fr: Bibliothèque de scripts Gambas en ligne
hi: ऑनलाइन गाम्बस स्क्रिप्ट लाइब्रेरी
it: Libreria di script Gambas online

source: Online Lib
de: Online-Bibliothek
es_es: Biblioteca en línea
fr: Bibliothèque en ligne
hi: ऑनलाइन लाइब्रेरी
it: Biblioteca in linea

source: Open
de: Öffnen
es_es: Abierto
fr: Ouverte
hi: खुला हुआ
it: Aprire
ja: 開ける

source: Open an existing script
de: Öffnen Sie ein vorhandenes Skript
es_es: Abrir un script existente
fr: Ouvrir un script existant
hi: एक मौजूदा स्क्रिप्ट खोलें
it: Apri uno script esistente

source: Open Shell
de: Öffnen Sie die Shell
es_es: Concha abierta
fr: Ouvrez Shell
hi: खुला खोल
it: Guscio Aperto
ja: オープンシェル

source: Options
de: Optionen
es_es: Opciones
hi: विकल्प
it: Opzioni
ja: オプション

source: Password
de: Passwort
es_es: Clave
fr: Mot de passe
hi: पासवर्ड
ja: パスワード

source: Paste
de: Einfügen
es_es: Pegar
fr: Pâte
hi: गूंधा हुआ आटा
it: Colla
ja: ペースト

source: Print
de: Drucken
es_es: Impresión
fr: Impression
hi: छाप
it: Stampa
ja: 印刷

source: Print the script
es_es: Imprime el guion
fr: Imprimer le scénario
hi: स्क्रिप्ट प्रिंट करें
it: Stampa la sceneggiatura

source: Process Management
de: Prozessmanagement
es_es: Gestión de proceso
fr: La gestion des processus
hi: प्रक्रिया प्रबंधन
it: Gestione dei processi
ja: プロセス管理

source: Result Page
de: Ergebnisseite
es_es: Página de resultados
fr: Page de résultats
hi: परिणाम पृष्ठ
it: Pagina dei risultati
ja: 結果ページ

source: Result Window
de: Ergebnisfenster
es_es: Ventana de resultados
fr: Fenêtre de résultat
hi: परिणाम विंडो
it: Finestra dei risultati
ja: 結果ウィンドウ

source: Run
de: Lauf
es_es: Correr
fr: Courir
hi: दौड़ना
it: Correre
ja: 走る

source: Run Selected
de: Ausgewählte ausführen
es_es: Ejecutar seleccionado
fr: Exécuter la sélection
hi: चयनित भागो
it: Esegui selezionato
ja: 選択した実行

source: Run Selected Text
de: Ausgewählten Text ausführen
es_es: Ejecutar texto seleccionado
fr: Exécuter le texte sélectionné
hi: चयनित पाठ चलाएँ
it: Esegui testo selezionato
ja: 選択したテキストを実行

source: Sample Desktop file
de: Beispiel-Desktop-Datei
es_es: Ejemplo de archivo de escritorio
fr: Exemple de fichier de bureau
hi: नमूना डेस्कटॉप फ़ाइल
it: File desktop di esempio
ja: サンプルデスクトップファイル

source: Save
de: Sparen
es_es: Ahorrar
fr: sauver
hi: बचाना
it: Salva
ja: 保存する

source: Save As
de: Speichern als
es_es: Guardar como
fr: Enregistrer sous
hi: इस प्रप में सहेजें
it: Salva come
ja: 名前を付けて保存

source: Save as a Script file
de: Als Skriptdatei speichern
es_es: Guardar como un archivo de secuencia de comandos
fr: Enregistrer en tant que fichier de script
hi: स्क्रिप्ट फ़ाइल के रूप में सहेजें
it: Salva come file di script
ja: スクリプトファイルとして保存

source: Save Copy As
de: Kopie speichern unter
es_es: Guardar copia como
fr: Enregistrer la copie sous
hi: कॉपी को इस रूप में सहेजें
it: Salva copia con nome
ja: 名前を付けてコピーを保存

source: Save the script
de: Speichern Sie das Skript
es_es: Guardar el guión
fr: Enregistrer le script
hi: स्क्रिप्ट सहेजें
it: Salva lo script

source: Save the script to a new location
de: Speichern Sie das Skript an einem neuen Ort
es_es: Guarde el script en una nueva ubicación
fr: Enregistrez le script dans un nouvel emplacement
hi: स्क्रिप्ट को नए स्थान पर सहेजें
it: Salva lo script in una nuova posizione

source: Save to ~/bin and Make Executable
de: Speichern Sie in ~/bin und machen Sie es ausführbar
es_es: Guardar en ~/bin y hacer ejecutable
fr: Enregistrer dans ~ / bin et rendre exécutable
hi: ~/बिन में सहेजें और निष्पादन योग्य बनाएं
it: Salva in ~ / bin e rendi eseguibile
ja: 〜/ binに保存し、実行可能ファイルにします

source: Script Builder A simple editor to produce as output executable Gambas3 scripts - .gbs Requires Gambas >= 3.12 .. Tested with version 12,13,14,15.16 Updated Execution templates Bugfix Detection when script is executable as #!/usr/bin/env gbs3 Updated to use /usr/bin/env gbs3 Japanese Translation Add Itialian Translation ... Sorry if it's not to good! Removed wget and replaced with httpClient.download Insert #! as required Warn When saved file is not executable. Add French Translation Add German Translation FIX Updated to always keep an editor page open when exiting Playground or Nibble pages NEW change wget call to no longer produce log files in user directory NEW Added double click on Playground and network Nibble examples to open in editor for execution. NEW Add menu New sub menu for Simple and Graphic scripts NEW Tool button now creates new simple script, no longer graphic script. NEW Add tool bar, printing, fixed fonts, f5 for go FIX Updated to fix issues with transfer to Editor, added Nibble online library FIX Corrected Wget startup when app not started from terminal or gui FIX Corrected Documentation content FIX Updated to correctly Identify Charlie Ogier as Playground Example Authour FIX Updated so running examples without first saving to a file works correctly NEW Added Gambas playground example access from gambas one FIX Updated New to put correct time and date in comment, gb.gui used now. FIX Updated Shell defaulted to csh, now tests if installed , if not resorts to bash FIX Updated to fix screen issues and include DEBUG FIX Updated so that names with spaces work correctly and parameters are passed correctly from the command line.
de: Script Builder Ein einfacher Editor, um ausführbare Gambas3-Skripte als Ausgabe zu erzeugen - .gbs Benötigt Gambas >= 3.12 .. Getestet mit Version 12,13,14,15.16 Aktualisierte Ausführungsvorlagen Bugfix Erkennung, wenn Skript als # ausführbar ist! /usr/bin/env gbs3 Aktualisiert, um /usr/bin/env gbs3 zu verwenden Japanische Übersetzung Italienische Übersetzung hinzufügen ... Tut mir leid, wenn es nicht so gut ist! wget entfernt und durch httpClient.download ersetzt # einfügen! nach Bedarf Warnen, wenn gespeicherte Datei nicht ausführbar ist. Französische Übersetzung hinzufügen Deutsche Übersetzung hinzufügen FIX Aktualisiert, um beim Verlassen von Playground- oder Nibble-Seiten immer eine Editorseite geöffnet zu lassen NEU Änderung des wget-Aufrufs, um keine Protokolldateien mehr im Benutzer zu erstellen Verzeichnis NEU Doppelklick auf Playground- und Netzwerknibble-Beispiele hinzugefügt, um sie im Editor zur Ausführung zu öffnen. NEU Menü hinzufügen Neues Untermenü für einfache und grafische Skripte NEU Werkzeugschaltfläche erstellt jetzt ein neues einfaches Skript, kein grafisches Skript mehr. NEU Werkzeugleiste, Drucken, feste Schriftarten, f5 für go FIX Aktualisiert, um Probleme mit der Übertragung zum Editor zu beheben, Nibble-Online-Bibliothek hinzugefügt FIX Korrigierter Wget-Start, wenn die App nicht vom Terminal oder der GUI gestartet wurde FIX Korrigierter Dokumentationsinhalt FIX Korrigiert auf korrekt Identifizieren Sie Charlie Ogier als Playground-Beispielautor FIX Aktualisiert, sodass das Ausführen von Beispielen ohne vorheriges Speichern in einer Datei korrekt funktioniert NEU Zugriff auf das Gambas-Playground-Beispiel von Gambas One hinzugefügt FIX Aktualisiert Neu zu setzen Korrekte Zeit und Datum im Kommentar, gb.gui wird jetzt verwendet. FIX Aktualisiert Shell standardmäßig auf csh, testet jetzt, ob installiert, wenn nicht auf bash zurückgreift FIX Aktualisiert, um Bildschirmprobleme zu beheben und DEBUG einzubeziehen FIX Aktualisiert, damit Namen mit Leerzeichen funktionieren korrekt und die Parameter werden korrekt von der Befehlszeile übergeben.
es_es: Script Builder Un editor simple para producir como salida ejecutable Gambas3 scripts - .gbs Requiere Gambas >= 3.12 .. Probado con la versión 12,13,14,15.16 Actualización de plantillas de ejecución Detección de corrección de errores cuando el script es ejecutable como #! /usr/bin/env gbs3 Actualizado para usar /usr/bin/env gbs3 Traducción al japonés Agregar traducción al italiano... ¡Lo siento si no es demasiado bueno! Se eliminó wget y se reemplazó con httpClient.download Insert #! según sea necesario Advertir cuando el archivo guardado no es ejecutable. Agregar traducción al francés Agregar traducción al alemán FIX Actualizado para mantener siempre abierta una página del editor al salir de las páginas de Playground o Nibble NUEVO cambiar la llamada wget para que ya no genere archivos de registro en el usuario directorio NUEVO Se agregó doble clic en Playground y ejemplos de red Nibble para abrir en el editor para su ejecución. NUEVO Agregar menú Nuevo submenú para secuencias de comandos simples y gráficas NUEVO El botón de herramienta ahora crea una nueva secuencia de comandos simple, ya no una secuencia de comandos gráfica. NUEVA Agregar barra de herramientas, impresión, fuentes fijas, f5 para go FIX Actualizado para solucionar problemas con la transferencia al Editor, se agregó la biblioteca en línea de Nibble FIX Se corrigió el inicio de Wget cuando la aplicación no se iniciaba desde la terminal o gui FIX Se corrigió el contenido de la documentación FIX Se actualizó correctamente Identificar a Charlie Ogier como autor del ejemplo de Playground FIX Actualizado para que ejecutar ejemplos sin guardar primero en un archivo funcione correctamente NUEVO Se agregó el acceso al ejemplo de Gambas Playground desde Gambas One FIX Actualizado Nuevo para poner hora y fecha correctas en el comentario, se usa gb.gui ahora. FIX Actualizado Shell predeterminado a csh, ahora prueba si está instalado, si no recurre a bash FIX Actualizado para solucionar problemas de pantalla e incluye DEBUG FIX Actualizado para que los nombres con espacios funcionen correctamente y los parámetros se pasan correctamente desde la línea de comandos.
fr: Générateur de scripts Un éditeur simple pour produire en sortie des scripts Gambas3 exécutables - .gbs Nécessite Gambas >= 3.12 .. Testé avec les versions 12,13,14,15.16 Modèles d'exécution mis à jour Correction de bug Détection lorsque le script est exécutable en tant que # ! /usr/bin/env gbs3 Mise à jour pour utiliser /usr/bin/env gbs3 Traduction japonaise Ajouter une traduction italienne... Désolé si ce n'est pas bon ! Wget supprimé et remplacé par httpClient.download Insérez # ! selon les besoins Avertir lorsque le fichier enregistré n'est pas exécutable. Ajouter une traduction française Ajouter une traduction allemande FIX Mise à jour pour toujours garder une page d'éditeur ouverte lors de la sortie des pages Playground ou Nibble NOUVELLE modification de l'appel wget pour ne plus produire de fichiers journaux dans l'utilisateur répertoire NOUVEAU Ajout d'un double-clic sur les exemples Playground et Network Nibble à ouvrir dans l'éditeur pour exécution. NOUVEAU menu Ajouter Nouveau sous-menu pour les scripts simples et graphiques NOUVEAU bouton Outil crée désormais un nouveau script simple, et non plus un script graphique. NOUVEAU Ajouter une barre d'outils, l'impression, des polices fixes, f5 pour aller FIX Mise à jour pour résoudre les problèmes de transfert vers l'éditeur, ajout de la bibliothèque en ligne Nibble FIX Correction du démarrage de Wget lorsque l'application n'est pas démarrée à partir du terminal ou de l'interface graphique FIX Correction du contenu de la documentation FIX Mis à jour correctement Identifiez Charlie Ogier en tant qu'auteur de l'exemple de terrain de jeu FIX Mise à jour pour que l'exécution d'exemples sans enregistrement préalable dans un fichier fonctionne correctement NEW Ajout de l'accès à l'exemple de terrain de jeu Gambas à partir de gambas one FIX Mis à jour Nouveau à mettre heure et date correctes dans le commentaire, gb.gui utilisé maintenant. FIX Mise à jour du shell par défaut sur csh, teste maintenant s'il est installé, sinon recours à bash FIX Mise à jour pour résoudre les problèmes d'écran et inclure DEBUG FIX Mise à jour pour que les noms avec des espaces fonctionnent correctement et les paramètres sont passés correctement depuis la ligne de commande.

source: Script Builder Help
de: Script Builder-Hilfe
es_es: Ayuda de ScriptBuilder
fr: Aide de Script Builder
hi: स्क्रिप्ट निर्माता सहायता
it: Script Builder Aiuto
ja: Script Builder ヘルプ

source: Script Files
de: Skriptdateien
es_es: Archivos de secuencias de comandos
fr: Fichiers de script
hi: स्क्रिप्ट फ़ाइलें
it: File di script
ja: スクリプトファイル

source: Scripting Project Directory
de: Scripting-Projektverzeichnis
es_es: Directorio de proyectos de secuencias de comandos
fr: Répertoire de projets de script
hi: स्क्रिप्टिंग परियोजना निर्देशिका
it: Directory del progetto di scripting
ja: スクリプトプロジェクトディレクトリ

source: Select All
de: Wählen Sie Alle
es_es: Seleccionar todo
fr: Tout sélectionner
hi: सभी का चयन करे
it: Seleziona tutto
ja: すべて選択
