Repository: justlostintime/ScriptBuilder
Catalog: .lang/*.po
Languages: de, es_es, fr, hi, it, ja

source: Select the file to be Included
de: Wählen Sie die einzuschließende Datei aus
es_es: Seleccione el archivo a incluir
fr: Sélectionnez le fichier à inclure
hi: शामिल करने के लिए फ़ाइल का चयन करें
it: Seleziona il file da includere

source: Set Local Resource Lib Location
de: Legen Sie den Speicherort der lokalen Ressourcenbibliothek fest
es_es: Establecer la ubicación de la biblioteca de recursos locales
fr: Définir l'emplacement de la bibliothèque de ressources locales
hi: स्थानीय संसाधन पुस्तकालय स्थान सेट करें
it: Imposta la posizione della libreria di risorse locali

source: Set Printer
de: Drucker einstellen
es_es: Configurar impresora
fr: Définir l'imprimante
hi: प्रिंटर सेट करें
it: Imposta stampante
ja: プリンターの設定

source: Set the environmental options
de: Stellen Sie die Umgebungsoptionen ein
es_es: Establecer las opciones ambientales
fr: Définir les options d'environnement
hi: पर्यावरण विकल्प सेट करें
it: Imposta le opzioni ambientali

source: Shell
de: Schale
es_es: Caparazón
fr: Définir l'imprimante
hi: सीप
ja: シェル

source: Shell Command
de: Shell-Befehl
es_es: Comando de shell
fr: Commande Shell
hi: शेल कमांड
it: Comando Shell
ja: シェルコマンド

source: Simple Script Examples
de: Einfache Skriptbeispiele
es_es: Ejemplos de guiones simples
fr: Exemples de scripts simples
hi: सरल स्क्रिप्ट उदाहरण
it: Esempi di script semplici
ja: 簡単なスクリプトの例

source: Source Code repository
de: Quellcode-Repository
es_es: Repositorio de código fuente
fr: Référentiel de code source
hi: स्रोत कोड भंडार
it: Repository del codice sorgente
ja: ソースコードリポジトリ

source: Stop
de: Halt
es_es: Deténgase
fr: Arrêtez
hi: विराम
it: Fermare
ja: やめる

source: Stop ->
de: Halt->
es_es: Deténgase->
fr: Arrêtez->
hi: विराम->
it: Fermare ->
ja: やめる ->

source: Stop a running script
de: Stoppen Sie ein laufendes Skript
es_es: Detener un script en ejecución
fr: Arrêter un script en cours d'exécution
hi: एक चल रही स्क्रिप्ट बंद करो
it: Arresta uno script in esecuzione

source: Sym not found
de: Sym nicht gefunden
es_es: Símbolo no encontrado
fr: Symbole introuvable
hi: प्रतीक नहीं मिला
it: Sym non trovato
ja: 記号が見つかりません

source: The specified Working Directory
de: Das angegebene Arbeitsverzeichnis
es_es: El directorio de trabajo especificado
fr: Le répertoire de travail spécifié
hi: निर्दिष्ट कार्य निर्देशिका
it: La directory di lavoro specificata
ja: 指定された作業ディレクトリ

source: This file will not be executable #!/usr/bin/env gbs3 - is required to make this file executable ADD?
de: Diese Datei ist nicht ausführbar #!/usr/bin/env gbs3 - ist erforderlich, um diese Datei ausführbar zu machen ADD?
es_es: Este archivo no será ejecutable #!/usr/bin/env gbs3: ¿es necesario para que este archivo sea ejecutable AÑADIR?
fr: Ce fichier ne sera pas exécutable #!/usr/bin/env gbs3 - est nécessaire pour rendre ce fichier exécutable ADD ?
hi: यह फ़ाइल निष्पादन योग्य नहीं होगी #!/usr/bin/env gbs3 - इस फ़ाइल को निष्पादन योग्य बनाने के लिए आवश्यक है जोड़ें?
it: Questo file non sarà eseguibile #!/usr/bin/env gbs3 - è necessario rendere questo file eseguibile ADD?

source: This Gambas 3 Scripting tool Is Intended To be used To build small utility scripts For the linux environment using the Gambas language.
de: Dieses Gambas 3-Scripting-Tool soll verwendet werden, um kleine Utility-Scripts für die Linux-Umgebung unter Verwendung der Gambas-Sprache zu erstellen.
es_es: Esta herramienta de secuencias de comandos de Gambas 3 está destinada a ser utilizada para crear pequeñas secuencias de comandos de utilidad para el entorno Linux utilizando el lenguaje Gambas.
fr: Cet outil de script Gambas 3 est destiné à être utilisé pour créer de petits scripts utilitaires pour l'environnement Linux en utilisant le langage Gambas.
hi: इस Gambas 3 स्क्रिप्टिंग टूल का उपयोग छोटी उपयोगिता स्क्रिप्ट बनाने के लिए किया जाना है, जो कि Gambas भाषा का उपयोग करके linux वातावरण के लिए है।
it: Questo strumento di scripting Gambas3 è progettato per essere utilizzato per creare piccoli script di utilità per l'ambiente Linux utilizzando il linguaggio Gambas.
ja: このGambas3スクリプトツールは、Gambas言語を使用するLinux環境用の小さなユーティリティスクリプトを作成するために使用することを目的としています。

source: Unable to read:
de: Kann nicht lesen:
es_es: Incapaz de leer:
fr: Incapable de lire:
hi: पढ़ते नहीं बन रहा:
it: Impossibile leggere:
ja: 読むことができません：

source: Use Nibble
de: Verwenden Sie Nibble
es_es: Usar mordisco
fr: Utiliser Nibble
hi: निबल का प्रयोग करें
it: Usa Nibble
ja: ニブルを使用する

source: User Name
de: Nutzername
es_es: Nombre de usuario
fr: Nom d'utilisateur
hi: उपयोगकर्ता नाम
it: Nome utente
ja: ユーザー名

source: Use This File
de: Verwenden Sie diese Datei
es_es: Usar este archivo
fr: Utilisez ce fichier
hi: इस फ़ाइल का प्रयोग करें
it: Usa questo file
ja: このファイルを使用する

source: Using Script Builder
de: Verwenden des Script Builder
es_es: Uso de ScriptBuilder
hi: स्क्रिप्ट बिल्डर का उपयोग करना
it: Usando Script Builer
ja: 使用する Script Builder

source: warning Symbol origin
de: Warnung Symbolherkunft
es_es: advertencia Origen del símbolo
fr: origine du symbole d'avertissement
hi: चेतावनी प्रतीक उत्पत्ति
ja: 警告シンボルの起源

source: Window
de: Fenster
es_es: Ventana
fr: Vitre
hi: खिड़की
it: Finestra
ja: 窓

source: Yes
de: Jawohl
es_es: Sí
fr: Oui
hi: हाँ
it: sì
ja: はい

source: No
de: Nein
fr: Non
hi: नहीं
ja: 番号

source: Command Line args->
it: Argomenti di comando->

source: Find
it: Trovare

source: Find Next
it: Trova il prossimo

source: Find Previous
it: Trova precedente

source: PlayGround
de: Spielplatz
fr: Cour de récréation
it: Terreno di gioco
ja: 遊び場

source: Refresh
it: Ricaricare

source: Script Builder - Online Library
it: Script Builder - Biblioteca in linea

source: Search
it: Ricerca

source: Undo
it: Disfare
